import matplotlib.pyplot as plt
import numpy as np

t = [5, 10, 20, 50]
m = [39.35, 63.21, 86.47, 99.33]

N = 100
b = 0,1

t_smooth = np.linspace(0, 55, 600)
m_smooth =  N * (1 - np.exp(-0.1 * t_smooth))
plt.plot(t, m, 'ro')
plt.plot(t_smooth, m_smooth, linewidth=2)
plt.axhline(y=100, color='orange', linestyle='--')
plt.figure(figsize=(8, 5))
plt.xlabel(t)
plt.ylabel(m)
plt.plot(m,t)
plt.show()

# E = 2, 718
# По формуле m(t) = N (1 – e^-bt)
# m(5) = 100 * ( 1 – e^-0,1*5) = 100 * (1 – e^-0.5) = 100 * (1 – 0,6065) = 100 * 0,3935 = 39,35
# m(10) = 100 * (1 – e^-0,1*10) = 100 * (1 – e^-1) = 100 *(1 – 0,3679) = 100 * 0,6321 = 63,21
# m(20) = 100 * (1 – e^-0,1*20) = 100 * (1 – e^-2) = 100 * (1 – 0,1353) = 100 * 0,8647 = 86,47
# m(50) = 100 * (1 – e^-0,1*50) = 100 * (1 – e^-5) = 100 * (1 – 0,0067) = 100 * 0,9933 = 99,33 

#1. Параметр N означает то что программа гарантировано небудет сбоить
# 2. График никогда не пересекает эту линию N потому что никогда нет гарантий, что программа не будет сбоить
